In [5]:
import numpy as np
import pandas as pd

In [13]:
s1=pd.Series([10,20,30,40,50])

In [14]:
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [15]:
df1=pd.DataFrame(s1)

In [32]:
df1

    0
0  10
1  20
2  30
3  40
4  50

In [39]:
s2=pd.Series(np.arange(11,16))

In [40]:
s2

0    11
1    12
2    13
3    14
4    15
dtype: int32

In [41]:
pd.DataFrame([s1,s2])

    0   1   2   3   4
0  10  20  30  40  50
1  11  12  13  14  15

In [45]:
pd.DataFrame(pd.Series(np.arange(10,100,10)))

    0
0  10
1  20
2  30
3  40
4  50
5  60
6  70
7  80
8  90

In [48]:
dict1={
        "A":100,
        "B":200,
        "C":300,
        "D" : 400
}

In [47]:
dict1

{'A': 100, 'B': 200, 'C': 300}

In [49]:
pd.DataFrame([dict1])

     A    B    C    D
0  100  200  300  400

In [50]:
dic2 = {
    
        "NAME" : ['AAA','BBB','CCC','DDD'],
        "Class" :[10,12,11,10],
        "Computer" : [80,60,85,75],
        "Science" : [59,60,85, 90]
}

In [54]:
df_std=pd.DataFrame(dic2)

In [55]:
df_std

  NAME  Class  Computer  Science
0  AAA     10        80       59
1  BBB     12        60       60
2  CCC     11        85       85
3  DDD     10        75       90

In [6]:
dic3 = {
    
    "Name" : ["A","B","C","D"],
    "Class" : np.arange(8, 15, 2),
    "English" : pd.Series(np.random.randint(60,85,(4,)))
    
}

In [57]:
dic3

{'Name': ['A', 'B', 'C', 'D'],
 'Class': array([ 8, 10, 12, 14]),
 'English': 0    80
 1    82
 2    63
 3    82
 dtype: int32}

In [58]:
pd.DataFrame(dic3)

  Name  Class  English
0    A      8       80
1    B     10       82
2    C     12       63
3    D     14       82

In [59]:
df_std

  NAME  Class  Computer  Science
0  AAA     10        80       59
1  BBB     12        60       60
2  CCC     11        85       85
3  DDD     10        75       90

In [67]:
df_std.Computer

0    80
1    60
2    85
3    75
Name: Computer, dtype: int64

In [82]:
dict1={
    "eid":pd.Series(np.arange(10,20,3)),
    "Ename":["Raj","Rahul","Ashwini","Vivek"],
    "esal":pd.Series(np.random.randint(100000,200000,(4,)))
}

In [87]:
pd.DataFrame(dict1)

   eid    Ename    esal  hike percentage
0   10      Raj  106547              NaN
1   13    Rahul  102822              NaN
2   16  Ashwini  187433              NaN
3   19    Vivek  145945              NaN

In [85]:
dict1["hike percentage"]=np.nan

{'eid': 0    10
 1    13
 2    16
 3    19
 dtype: int32,
 'Ename': ['Raj', 'Rahul', 'Ashwini', 'Vivek'],
 'esal': 0    106547
 1    102822
 2    187433
 3    145945
 dtype: int32,
 'hike percentage': nan}

In [88]:
pd.DataFrame(dict1)

   eid    Ename    esal  hike percentage
0   10      Raj  106547              NaN
1   13    Rahul  102822              NaN
2   16  Ashwini  187433              NaN
3   19    Vivek  145945              NaN

In [89]:
del dict1["hike percentage"]

In [10]:
df1=pd.DataFrame(dict1)

NameError: name 'dict1' is not defined

In [ ]:
#df_std["Grade3"] = df_std["Average"].apply( lambda x : np.where(x >= 80, "A", np.where(x>70,"B","C")))

In [105]:
dict1["hike percentage"] = dict1["esal"].apply( lambda x : np.where(x >= 150000, "A", np.where(x>100000,"B","C")))

In [3]:
df1

NameError: name 'df1' is not defined

In [2]:
df1

NameError: name 'df1' is not defined

In [16]:
df1

    0
0  10
1  20
2  30
3  40
4  50

In [17]:
df1.melt()

   variable  value
0         0     10
1         0     20
2         0     30
3         0     40
4         0     50